let timeframe = 7d;
let TI = ThreatIntelligenceIndicator
| where TimeGenerated > ago(timeframe)
| where Active == true and ExpirationDateTime > now();
CommonSecurityLog
| where TimeGenerated > ago(timeframe)
| join kind=inner (
    TI
) on $left.DestinationIP == $right.NetworkIP 
